# IdeaStatiCa.ConnectionApi.Model.ReferenceElement

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**TypeName** | **string** |  | [optional]
**Id** | **int** |  | [optional]
**Element** | **OpenElementId** |  | [optional]

[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)